# Exercice 2

In [1]:
import pandas as pd
import numpy as np

In [4]:
df1=pd.read_csv(r'C:\Users\thinkbook\Documents\GitHub\Programmation2\ImportationExportationDonnées\data\nyc_taxi_2019-07.csv',
                
               usecols=['passenger_count','trip_distance','payment_type','total_amount'],
               header=0
              )

In [5]:
df1

         passenger_count  trip_distance  payment_type  total_amount
0                    1.0           0.00           1.0          4.94
1                    1.0           4.16           2.0         20.30
2                    1.0          18.80           1.0         70.67
3                    1.0          18.46           1.0         66.36
4                    0.0           1.70           1.0         15.30
...                  ...            ...           ...           ...
6310414              NaN           3.86           NaN         29.00
6310415              NaN          15.48           NaN         54.43
6310416              NaN          12.92           NaN         65.40
6310417              NaN           7.12           NaN         43.00
6310418              NaN           1.77           NaN         22.15

[6310419 rows x 4 columns]

In [6]:
df1['year']=2019
df1

         passenger_count  trip_distance  payment_type  total_amount  year
0                    1.0           0.00           1.0          4.94  2019
1                    1.0           4.16           2.0         20.30  2019
2                    1.0          18.80           1.0         70.67  2019
3                    1.0          18.46           1.0         66.36  2019
4                    0.0           1.70           1.0         15.30  2019
...                  ...            ...           ...           ...   ...
6310414              NaN           3.86           NaN         29.00  2019
6310415              NaN          15.48           NaN         54.43  2019
6310416              NaN          12.92           NaN         65.40  2019
6310417              NaN           7.12           NaN         43.00  2019
6310418              NaN           1.77           NaN         22.15  2019

[6310419 rows x 5 columns]

In [7]:
df2=pd.read_csv(r'C:\Users\thinkbook\Documents\GitHub\Programmation2\ImportationExportationDonnées\data\nyc_taxi_2020-07.csv',
                
               usecols=['passenger_count','trip_distance','payment_type','total_amount'],
               header=0
              )

In [8]:
df2

        passenger_count  trip_distance  payment_type  total_amount
0                   1.0           1.50           2.0          9.30
1                   1.0           9.50           1.0         27.80
2                   1.0           5.85           2.0         22.30
3                   1.0           1.90           1.0         14.16
4                   1.0           1.25           2.0          7.80
...                 ...            ...           ...           ...
800407              NaN          24.23           NaN         83.50
800408              NaN           4.40           NaN         19.78
800409              NaN           8.78           NaN         38.45
800410              NaN           6.50           NaN         29.77
800411              NaN          10.88           NaN         51.90

[800412 rows x 4 columns]

In [10]:
df2['year']=2020
df2

        passenger_count  trip_distance  payment_type  total_amount  year
0                   1.0           1.50           2.0          9.30  2020
1                   1.0           9.50           1.0         27.80  2020
2                   1.0           5.85           2.0         22.30  2020
3                   1.0           1.90           1.0         14.16  2020
4                   1.0           1.25           2.0          7.80  2020
...                 ...            ...           ...           ...   ...
800407              NaN          24.23           NaN         83.50  2020
800408              NaN           4.40           NaN         19.78  2020
800409              NaN           8.78           NaN         38.45  2020
800410              NaN           6.50           NaN         29.77  2020
800411              NaN          10.88           NaN         51.90  2020

[800412 rows x 5 columns]

In [15]:
df=pd.concat([df1,df2],ignore_index=True)
df

         passenger_count  trip_distance  payment_type  total_amount  year
0                    1.0           0.00           1.0          4.94  2019
1                    1.0           4.16           2.0         20.30  2019
2                    1.0          18.80           1.0         70.67  2019
3                    1.0          18.46           1.0         66.36  2019
4                    0.0           1.70           1.0         15.30  2019
...                  ...            ...           ...           ...   ...
7110826              NaN          24.23           NaN         83.50  2020
7110827              NaN           4.40           NaN         19.78  2020
7110828              NaN           8.78           NaN         38.45  2020
7110829              NaN           6.50           NaN         29.77  2020
7110830              NaN          10.88           NaN         51.90  2020

[7110831 rows x 5 columns]

In [16]:
print("Nombre de trajets effectués en 2019 est ->",
      df[df['year'] ==2019]['trip_distance'].count())

Nombre de trajets effectués en 2019 est -> 6310419

In [17]:
print("Nombre de trajets effectués en 2020 est ->",
      df[df['year'] ==2020]['trip_distance'].count())

Nombre de trajets effectués en 2020 est -> 800412

In [18]:
print("La différence entre 2019 et  2020 est ->",
      df[df['year'] ==2019]['trip_distance'].count()-df[df['year'] ==2020]['trip_distance'].count())

La différence entre 2019 et  2020 est -> 5510007

In [19]:
print("total argent collecté en 2019 est ->",
      df[df['year'] ==2019]['total_amount'].sum())

total argent collecté en 2019 est -> 123761823.33000001

In [20]:
print("total argent collecté en 2020 est ->",
      df[df['year'] ==2020]['total_amount'].sum())

total argent collecté en 2020 est -> 14912844.090000005

In [21]:
print("La différence entre 2019 et  2020 est ->",
       df[df['year'] ==2019]['total_amount'].sum()-df[df['year'] ==2020]['total_amount'].sum())

La différence entre 2019 et  2020 est -> 108848979.24000001

In [22]:
print("Nombre de déplacements en 2019 ayant plus qu'un passager ->",
      df[(df['year'] ==2019) & (df['passenger_count'] > 1)]['passenger_count'].count())

Nombre de déplacements en 2019 ayant plus qu'un passager -> 1778686

In [23]:
print("Nombre de déplacements en 2020 ayant plus qu'un passager ->",
      df[(df['year'] ==2020) & (df['passenger_count'] > 1)]['passenger_count'].count())

Nombre de déplacements en 2020 ayant plus qu'un passager -> 152050

In [24]:
print("La différence entre 2019 et 2020 est très significative. Elle est égale à  ",
      df[(df['year'] ==2019) & (df['passenger_count'] > 1)]['passenger_count'].count()-df[(df['year'] ==2020) & (df['passenger_count'] > 1)]['passenger_count'].count())

La différence entre 2019 et 2020 est très significative. Elle est égale à   1626636

In [25]:
print("Nombre de déplacements payés en espèce en 2019 ->",
      df[(df['payment_type'] == 2) & (df['year'] ==2019)]['passenger_count'].count())

Nombre de déplacements payés en espèce en 2019 -> 1801718

In [26]:
print("Nombre de déplacements payés en espèce en 2022 ->",
      df[(df['payment_type'] == 2) & (df['year'] ==2020)]['passenger_count'].count())

Nombre de déplacements payés en espèce en 2022 -> 236433